Revit 2024 API
BuiltInFailures.StairRampFailures.StairsOtherThan2IntsByRiserAndBoundaryFailure Property
 More than 2 intersection points between riser segment and boundary encountered
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsOtherThan2IntsByRiserAndBoundaryFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsOtherThan2IntsByRiserAndBoundaryFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsOtherThan2IntsByRiserAndBoundaryFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace